app/controllers/microposts_controller.rb

SELECT `microposts`.* FROM `microposts`
---
  def index
    @microposts = Micropost.all

INSERT INTO `microposts` (`contend`, `user_id`, `created_at`, `updated_at`) VALUES ('helo hello', 1, '2020-07-30 08:26:49.966597', '2020-07-30 08:26:49.966597')
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save

SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 1 LIMIT 1
---
    def set_micropost
      @micropost = Micropost.find(params[:id])